In [34]:
import pandas as pd
import os

In [4]:
df_0 = pd.read_csv("data/daily_sales_data_0.csv")
df_1 = pd.read_csv("data/daily_sales_data_1.csv")
df_2 = pd.read_csv("data/daily_sales_data_2.csv")

In [5]:
df_0.head()

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [6]:
df_1.head()

       product  price  quantity        date region
0  pink morsel  $3.00       545  2019-06-11  north
1  pink morsel  $3.00       521  2019-06-11  south
2  pink morsel  $3.00       595  2019-06-11   east
3  pink morsel  $3.00       507  2019-06-11   west
4  gold morsel  $9.99       529  2019-06-11  north

In [8]:
df_2.head()

       product  price  quantity        date region
0  pink morsel  $3.00       526  2020-10-13  north
1  pink morsel  $3.00       546  2020-10-13  south
2  pink morsel  $3.00       505  2020-10-13   east
3  pink morsel  $3.00       561  2020-10-13   west
4  gold morsel  $9.99       553  2020-10-13  north

In [11]:
df_0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13720 entries, 0 to 13719
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   13720 non-null  object
 1   price     13720 non-null  object
 2   quantity  13720 non-null  int64
 3   date      13720 non-null  object
 4   region    13720 non-null  object
dtypes: int64(1), object(4)
memory usage: 536.1+ KB

In [12]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13720 entries, 0 to 13719
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   13720 non-null  object
 1   price     13720 non-null  object
 2   quantity  13720 non-null  int64
 3   date      13720 non-null  object
 4   region    13720 non-null  object
dtypes: int64(1), object(4)
memory usage: 536.1+ KB

In [13]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13720 entries, 0 to 13719
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   13720 non-null  object
 1   price     13720 non-null  object
 2   quantity  13720 non-null  int64
 3   date      13720 non-null  object
 4   region    13720 non-null  object
dtypes: int64(1), object(4)
memory usage: 536.1+ KB

In [14]:
# Convert the 'date' column to datetime format
df_0['date'] = pd.to_datetime(df_0['date'])
df_1['date'] = pd.to_datetime(df_1['date'])
df_2['date'] = pd.to_datetime(df_2['date'])

In [15]:
# Get the range of dates for each DataFrame
range_df_0 = (df_0['date'].min(), df_0['date'].max())
range_df_1 = (df_1['date'].min(), df_1['date'].max())
range_df_2 = (df_2['date'].min(), df_2['date'].max())

# Print the results
print("Date range for df_0:", range_df_0)
print("Date range for df_1:", range_df_1)
print("Date range for df_2:", range_df_2)

Date range for df_0: (Timestamp('2018-02-06 00:00:00'), Timestamp('2019-06-10 00:00:00'))
Date range for df_1: (Timestamp('2019-06-11 00:00:00'), Timestamp('2020-10-12 00:00:00'))
Date range for df_2: (Timestamp('2020-10-13 00:00:00'), Timestamp('2022-02-14 00:00:00'))

In [22]:
# Combine the DataFrames
combined_df = pd.concat([df_0, df_1, df_2], ignore_index=True)

In [23]:
combined_df.head()

       product  price  quantity       date region
0  pink morsel  $3.00       546 2018-02-06  north
1  pink morsel  $3.00       549 2018-02-06  south
2  pink morsel  $3.00       577 2018-02-06   east
3  pink morsel  $3.00       519 2018-02-06   west
4  gold morsel  $9.99       580 2018-02-06  north

In [27]:
# Filter rows where the 'product' column is 'pink morsel'
filtered_df = combined_df[combined_df['product'] == 'pink morsel']

In [28]:
filtered_df.head()

        product  price  quantity       date region
0   pink morsel  $3.00       546 2018-02-06  north
1   pink morsel  $3.00       549 2018-02-06  south
2   pink morsel  $3.00       577 2018-02-06   east
3   pink morsel  $3.00       519 2018-02-06   west
28  pink morsel  $3.00       529 2018-02-07  north

In [29]:
# Convert 'price' to numeric by stripping the dollar sign and converting to float
filtered_df['price'] = filtered_df['price'].str.replace('[\$,]', '', regex=True).astype(float)

# Create 'sales' column by multiplying 'quantity' by 'price'
filtered_df['sales'] = filtered_df['quantity'] * filtered_df['price']

# Drop 'quantity' and 'price' columns
filtered_df = filtered_df.drop(['quantity', 'price'], axis=1)

<>:2: SyntaxWarning: invalid escape sequence '\$'
<>:2: SyntaxWarning: invalid escape sequence '\$'
/var/folders/dd/60xf0h7548j56j29bvnr7tw40000gn/T/ipykernel_7791/334025596.py:2: SyntaxWarning: invalid escape sequence '\$'
  filtered_df['price'] = filtered_df['price'].str.replace('[\$,]', '', regex=True).astype(float)
/var/folders/dd/60xf0h7548j56j29bvnr7tw40000gn/T/ipykernel_7791/334025596.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df['price'] = filtered_df['price'].str.replace('[\$,]', '', regex=True).astype(float)
/var/folders/dd/60xf0h7548j56j29bvnr7tw40000gn/T/ipykernel_7791/334025596.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df['sales'] = filtered_df['quantity'] * filtered_df['price']

In [31]:
filtered_df.head()

        product       date region   sales
0   pink morsel 2018-02-06  north  1638.0
1   pink morsel 2018-02-06  south  1647.0
2   pink morsel 2018-02-06   east  1731.0
3   pink morsel 2018-02-06   west  1557.0
28  pink morsel 2018-02-07  north  1587.0

In [39]:
# Change directory as needed
folder_path = '/Users/bassamelkoussa/Downloads/VS Code/quantium-starter-repo/data'

In [40]:
# Now export 'filtered_df' to a CSV file in the 'data' directory
csv_file_path = os.path.join(folder_path, 'filtered_df.csv')
filtered_df.to_csv(csv_file_path, index=False)